src_doc/Documents/ДействиеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДействиеЗадачи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЗадачПоИсполнителям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчастника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВИсточнике</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДействийЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоОтметил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПричинаВозврата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписаниеФорматированное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеПричиныВозврата</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйАвтор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействияТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПриложениеОтчетовОбИсполнении</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_doc/CommonModules/КэшиНаВремяВызоваПовтИсп/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Кэши на время взова, для оптимизации работы (сервер, повторное использование).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует кеш области просмотра.
// 
// Возвращаемое значение:
//  Структура - Кеш области просмотра:
//   *  Заполнен - Булево.
//   *  Задача - ДокументСсылка.Задача.
//   *  ЗадачаОбъект - ДокументОбъект.Задача, Неопределено - Задача.
//   *  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   *  РеквизитыДействияЗадачи - Структура, Неопределено - Реквизиты действия задачи.
//   *  ДанныеДействияЗадачи - СтрокаТаблицыЗначений
//                           - Неопределено
//   *  ДанныеОбзораДокумента - ВыборкаИзРезультатаЗапроса
//                            - Неопределено
//   *  ЗадачаПроцесса - ЗадачаСсылка.ЗадачаИсполнителя
//   *  РеквизитыЗадачиПроцесса - Структура
//                              - Неопределено
//   *  Процесс - БизнесПроцессСсылка
//              - Неопределено
//   *  РеквизитыПроцесса - Структура
//                        - Неопределено
//   *  ДействиеОбработки - см. ОпределяемыйТип.Действия
//   *  РеквизитыДействияОбработки - Структура
//                                 - Неопределено
//   *  ОбработкаОбъекта - СправочникСсылка.ОбработкиОбъектов
//   *  РеквизитыОбработкиОбъекта - Структура
//                                - Неопределено
//   *  ВидДействия - СправочникСсылка.ВидыДействий
//   *  РеквизитыВидаДействия - Структура
//                            - Неопределено
//
Функция КэшЗадачаОбластьПросмотра() Экспорт
	
	КэшОбластиПросмотра = Новый Структура;
	КэшОбластиПросмотра.Вставить("Заполнен", Ложь);
	КэшОбластиПросмотра.Вставить("Задача", Документы.Задача.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("ЗадачаОбъект", Неопределено);
	КэшОбластиПросмотра.Вставить("ДействиеЗадачи", Документы.ДействиеЗадачи.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыДействияЗадачи", Неопределено);
	КэшОбластиПросмотра.Вставить("ДанныеДействияЗадачи", Неопределено);
	КэшОбластиПросмотра.Вставить("ДанныеОбзораДокумента", Неопределено);
	КэшОбластиПросмотра.Вставить("ЗадачаПроцесса", Задачи.ЗадачаИсполнителя.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыЗадачиПроцесса", Неопределено);
	КэшОбластиПросмотра.Вставить("Процесс", Неопределено);
	КэшОбластиПросмотра.Вставить("РеквизитыПроцесса", Неопределено);
	КэшОбластиПросмотра.Вставить("ДействиеОбработки", Неопределено);
	КэшОбластиПросмотра.Вставить("РеквизитыДействияОбработки", Неопределено);
	КэшОбластиПросмотра.Вставить("ОбработкаОбъекта", Справочники.ОбработкиОбъектов.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыОбработкиОбъекта", Неопределено);
	КэшОбластиПросмотра.Вставить("ВидДействия", Справочники.ВидыДействий.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыВидаДействия", Неопределено);
	
	Возврат КэшОбластиПросмотра;
	
КонецФункции

// Кэш для формы элементы справочника документы предприятия.
// 
// Возвращаемое значение:
//  Структура - Кэш для формы элементы справочника документы предприятия:
//   * Инициализирован - Булево - Кэш инициализирован.
//   * КэшДокумента - Структура - Кэш документа:
//     ** Ссылка - СправочникСсылка.ДокументыПредприятия.
//     ** ВидДокумента - СправочникСсылка.ВидыДокументов.
//     ** Шаблон - СправочникСсылка.ШаблоныДокументов.
//     ** ЕстьФайлыШаблона - Булево.
//     ** Контрагент - СправочникСсылка.Контрагенты.
//     ** ПодписалОтКонтрагента - СправочникСсылка.КонтактныеЛица.
//     ** ДатаСоздания - Дата.
//     ** ДатаРегистрации - Дата.
//     ** Стороны - ТабличнаяЧасть.
//   * КэшВидаДокумента - Структура - Кэш вида документа. См. Делопроизводство.КэшВидаДокумента.
//   * УчастникиРабочейГруппы - См. РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту.
//   * ВсеСостоянияДокумента - См. Делопроизводство.ПолучитьВсеСостоянияДокумента.
//   * КэшОбработки - Структура - Кэш обработки:
//     ** Ссылка - СправочникСсылка.ОбработкиОбъектов.
//     ** ДатаСоздания - Дата.
//     ** Состояние - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
//     ** ДатаИзмененияСостояния - Дата.
//     ** ДатаНачала - Дата.
//
Функция КэшДокументыПредприятияФормаЭлемента() Экспорт
	
	КэшДокументыПредприятияФормаЭлемента = Новый Структура;
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("Инициализирован", Ложь);
	
	КэшДокумента = Новый Структура;
	КэшДокумента.Вставить("Ссылка");
	КэшДокумента.Вставить("ВидДокумента");
	КэшДокумента.Вставить("Шаблон");
	КэшДокумента.Вставить("ЕстьФайлыШаблона");
	КэшДокумента.Вставить("Контрагент");
	КэшДокумента.Вставить("ПодписалОтКонтрагента");
	КэшДокумента.Вставить("ДатаСоздания");
	КэшДокумента.Вставить("ДатаРегистрации");
	КэшДокумента.Вставить("Стороны");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшДокумента", КэшДокумента);
	
	КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(Справочники.ВидыДокументов.ПустаяСсылка());
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшВидаДокумента", КэшВидаДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("УчастникиРабочейГруппы", Новый ТаблицаЗначений);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ВсеСостоянияДокумента", Новый ТаблицаЗначений);
	
	КэшОбработки = Новый Структура;
	КэшОбработки.Вставить("Ссылка");
	КэшОбработки.Вставить("ДатаСоздания");
	КэшОбработки.Вставить("Состояние");
	КэшОбработки.Вставить("ДатаИзмененияСостояния");
	КэшОбработки.Вставить("ДатаНачала");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшОбработки", КэшОбработки); 
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ТекущиеДействияПодписания", Новый ТаблицаЗначений);
	КэшДокументыПредприятияФормаЭлемента.Вставить("ТекущиеДействияУтверждения", Новый ТаблицаЗначений);
	
	Возврат КэшДокументыПредприятияФормаЭлемента;
	
КонецФункции

// Получает цвет стиля по имени.
//
// Параметры:
//  ИмяЦветаСтиля - Строка
// 
// Возвращаемое значение:
//  Цвет
//
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

// Кэш графиков работы отчета "Сводка работ".
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.Сотрудники
//   * Значение - СправочникСсылка.ГрафикиРаботы
//
Функция КэшГрафиковРаботы() Экспорт
	
	КэшГрафиковРаботы = Новый Соответствие;
	
	Возврат КэшГрафиковРаботы;
	
КонецФункции

// Кэш рабочих дней отчета "Сводка работ".
//
// Параметры:
//  ГрафикРаботы - СправочникСсылка.ГрафикиРаботы
// 
// Возвращаемое значение:
//  Структура:
//   * ЗаполненныеГода - Соответствие из КлючИЗначение:
//    ** Ключ - Число - Год.
//    ** Значение - Булево - Истина, если заполнено.
//   * РабочиеДни - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Булево - Это рабочий день.
//   * КоличествоРабочихДней - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Число - Количество рабочих дней относительно начала отсчёта.
//   * НачалоОтсчета - Дата.
//
Функция КэшРабочихДней(ГрафикРаботы) Экспорт
	
	КэшРабочихДней = Новый Структура;
	КэшРабочихДней.Вставить("ЗаполненныеГода", Новый Соответствие);
	КэшРабочихДней.Вставить("РабочиеДни", Новый Соответствие);
	КэшРабочихДней.Вставить("КоличествоРабочихДней", Новый Соответствие);
	КэшРабочихДней.Вставить("НачалоОтсчета", Дата(1, 1, 1));
	
	Возврат КэшРабочихДней;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует кэш обзора документа.
// 
// Возвращаемое значение:
//  Структура:
//   * Заполнен - Булево
//   * Документ - СправочникСсылка.ДокументыПредприятия
//   * РеквизитыДокумента - Структура
//                        - Неопределено
//   * ВидДокумента - СправочникСсылка.ВидыДокументов
//   * КэшВидаДокумента - Структура
//                      - Неопределено
// 
Функция КэшОбзораДокумента() Экспорт
	
	КэшОбзораДокумента = Новый Структура;
	КэшОбзораДокумента.Вставить("Заполнен", Ложь);
	КэшОбзораДокумента.Вставить("Документ", Справочники.ДокументыПредприятия.ПустаяСсылка());
	КэшОбзораДокумента.Вставить("РеквизитыДокумента", Неопределено);
	КэшОбзораДокумента.Вставить("ВидДокумента", Справочники.ВидыДокументов.ПустаяСсылка());
	КэшОбзораДокумента.Вставить("КэшВидаДокумента", Делопроизводство.НовыйКэшВидаДокумента());
	
	Возврат КэшОбзораДокумента;
	
КонецФункции

#КонецОбласти
